W4D4/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "melvin"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    # remember we never look people up by their password, it's not stored
    user = User.find_by(email: email)