W4D2/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        cat = Cat.new(cat_params)

        if cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "color" = $3, "birth_date" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["name", "Walter"], ["sex", "M"], ["color", "Gray"], ["birth_date", "2015-04-15"], ["description", ""], ["updated_at", "2019-01-29 23:29:40.574414"], ["id", 1]]
---
    def update
        cat = Cat.find(params[:id])

        if cat.update(cat_params)