W4D1/first_routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "email@gmail.com"], ["name", "Mason"], ["created_at", "2019-01-28 23:26:45.631282"], ["updated_at", "2019-01-28 23:26:45.631282"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "New_Melvin"], ["updated_at", "2019-01-29 00:21:11.433475"], ["id", 11]]
---
    def update
        user = User.find(params[:id])
        if user
            user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
    def destroy
        user = User.find(params[:id])
        if user
            user.destroy